Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM706.h
/* C2RXOVF1 */
/* Bitname _RXOVF0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF7 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF8 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF9 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF10 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF11 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF12 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF13 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF14 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF15 cannot be defined because it is used by more than one SFR */

/* C2RXOVF2 */
/* Bitname _RXOVF16 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF17 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF18 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF19 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF20 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF21 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF22 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF23 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF24 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF25 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF26 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF27 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF28 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF29 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF30 cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVF31 cannot be defined because it is used by more than one SFR */

/* C2RXM0SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2TR01CON */
/* Bitname _TX0PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX0PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX0PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX1PRI1 cannot be defined because it is used by more than one SFR */

/* C2RXM0EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* C2TR23CON */
/* Bitname _TX2PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TX2PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX2PRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TX3PRI1 cannot be defined because it is used by more than one SFR */

