Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM706.h
/* C2RXF15SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2RXF15EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* QEI2CON */
/* Bitname _CCM cannot be defined because it is used by more than one SFR */
/* Bitname _GATEN cannot be defined because it is used by more than one SFR */
/* Bitname _CNTPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INTDIV cannot be defined because it is used by more than one SFR */
/* Bitname _IMV cannot be defined because it is used by more than one SFR */
/* Bitname _PIMOD cannot be defined because it is used by more than one SFR */
/* Bitname _QEISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _QEIEN cannot be defined because it is used by more than one SFR */

/* QEI2IOC */
/* Bitname _QEA cannot be defined because it is used by more than one SFR */
/* Bitname _QEB cannot be defined because it is used by more than one SFR */
/* Bitname _INDEX cannot be defined because it is used by more than one SFR */
/* Bitname _HOME cannot be defined because it is used by more than one SFR */
/* Bitname _QEAPOL cannot be defined because it is used by more than one SFR */
/* Bitname _QEBPOL cannot be defined because it is used by more than one SFR */
/* Bitname _IDXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _HOMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SWPAB cannot be defined because it is used by more than one SFR */
/* Bitname _OUTFNC cannot be defined because it is used by more than one SFR */
/* Bitname _QFDIV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _QCAPEN cannot be defined because it is used by more than one SFR */

/* QEI2STAT */
/* Bitname _IDXIEN cannot be defined because it is used by more than one SFR */
/* Bitname _IDXIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIEN cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIRQ cannot be defined because it is used by more than one SFR */

/* PMCON */
#define _RDSP PMCONbits.RDSP
#define _WRSP PMCONbits.WRSP
#define _BEP PMCONbits.BEP
#define _CS1P PMCONbits.CS1P
#define _CS2P PMCONbits.CS2P
#define _ALP PMCONbits.ALP
#define _CSF PMCONbits.CSF
#define _PTRDEN PMCONbits.PTRDEN
#define _PTWREN PMCONbits.PTWREN
#define _PTBEEN PMCONbits.PTBEEN
#define _ADRMUX PMCONbits.ADRMUX
/* Bitname _PSIDL cannot be defined because it is used by more than one SFR */
#define _PMPEN PMCONbits.PMPEN
#define _CSF0 PMCONbits.CSF0
#define _CSF1 PMCONbits.CSF1
#define _ADRMUX0 PMCONbits.ADRMUX0
#define _ADRMUX1 PMCONbits.ADRMUX1

