Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM706.h
#define _OC8CON1_ENFLT1_POSITION                 0x00000008
#define _OC8CON1_ENFLT1_MASK                     0x00000100
#define _OC8CON1_ENFLT1_LENGTH                   0x00000001

#define _OC8CON2_SYNCSEL_POSITION                0x00000000
#define _OC8CON2_SYNCSEL_MASK                    0x0000001F
#define _OC8CON2_SYNCSEL_LENGTH                  0x00000005

#define _OC8CON2_OCTRIS_POSITION                 0x00000005
#define _OC8CON2_OCTRIS_MASK                     0x00000020
#define _OC8CON2_OCTRIS_LENGTH                   0x00000001

#define _OC8CON2_TRIGSTAT_POSITION               0x00000006
#define _OC8CON2_TRIGSTAT_MASK                   0x00000040
#define _OC8CON2_TRIGSTAT_LENGTH                 0x00000001

#define _OC8CON2_OCTRIG_POSITION                 0x00000007
#define _OC8CON2_OCTRIG_MASK                     0x00000080
#define _OC8CON2_OCTRIG_LENGTH                   0x00000001

#define _OC8CON2_OC32_POSITION                   0x00000008
#define _OC8CON2_OC32_MASK                       0x00000100
#define _OC8CON2_OC32_LENGTH                     0x00000001

#define _OC8CON2_DCB_POSITION                    0x00000009
#define _OC8CON2_DCB_MASK                        0x00000600
#define _OC8CON2_DCB_LENGTH                      0x00000002

#define _OC8CON2_OCINV_POSITION                  0x0000000C
#define _OC8CON2_OCINV_MASK                      0x00001000
#define _OC8CON2_OCINV_LENGTH                    0x00000001

#define _OC8CON2_FLTTRIEN_POSITION               0x0000000D
#define _OC8CON2_FLTTRIEN_MASK                   0x00002000
#define _OC8CON2_FLTTRIEN_LENGTH                 0x00000001

#define _OC8CON2_FLTOUT_POSITION                 0x0000000E
#define _OC8CON2_FLTOUT_MASK                     0x00004000
#define _OC8CON2_FLTOUT_LENGTH                   0x00000001

#define _OC8CON2_FLTMD_POSITION                  0x0000000F
#define _OC8CON2_FLTMD_MASK                      0x00008000
#define _OC8CON2_FLTMD_LENGTH                    0x00000001

#define _OC8CON2_SYNCSEL0_POSITION               0x00000000
#define _OC8CON2_SYNCSEL0_MASK                   0x00000001
#define _OC8CON2_SYNCSEL0_LENGTH                 0x00000001

#define _OC8CON2_SYNCSEL1_POSITION               0x00000001
#define _OC8CON2_SYNCSEL1_MASK                   0x00000002
#define _OC8CON2_SYNCSEL1_LENGTH                 0x00000001

#define _OC8CON2_SYNCSEL2_POSITION               0x00000002
#define _OC8CON2_SYNCSEL2_MASK                   0x00000004
#define _OC8CON2_SYNCSEL2_LENGTH                 0x00000001

#define _OC8CON2_SYNCSEL3_POSITION               0x00000003
#define _OC8CON2_SYNCSEL3_MASK                   0x00000008
#define _OC8CON2_SYNCSEL3_LENGTH                 0x00000001

#define _OC8CON2_SYNCSEL4_POSITION               0x00000004
#define _OC8CON2_SYNCSEL4_MASK                   0x00000010
#define _OC8CON2_SYNCSEL4_LENGTH                 0x00000001

#define _OC8CON2_DCB0_POSITION                   0x00000009
#define _OC8CON2_DCB0_MASK                       0x00000200
#define _OC8CON2_DCB0_LENGTH                     0x00000001

#define _OC8CON2_DCB1_POSITION                   0x0000000A
#define _OC8CON2_DCB1_MASK                       0x00000400
#define _OC8CON2_DCB1_LENGTH                     0x00000001

#define _OC8CON2_FLTMODE_POSITION                0x0000000E
#define _OC8CON2_FLTMODE_MASK                    0x00004000
#define _OC8CON2_FLTMODE_LENGTH                  0x00000001

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C4OUT_POSITION                   0x00000003
#define _CMSTAT_C4OUT_MASK                       0x00000008
#define _CMSTAT_C4OUT_LENGTH                     0x00000001

#define _CMSTAT_C5OUT_POSITION                   0x00000004
#define _CMSTAT_C5OUT_MASK                       0x00000010
#define _CMSTAT_C5OUT_LENGTH                     0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000008
#define _CMSTAT_C1EVT_MASK                       0x00000100
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000009
#define _CMSTAT_C2EVT_MASK                       0x00000200
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x0000000A
#define _CMSTAT_C3EVT_MASK                       0x00000400
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_C4EVT_POSITION                   0x0000000B
#define _CMSTAT_C4EVT_MASK                       0x00000800
#define _CMSTAT_C4EVT_LENGTH                     0x00000001

#define _CMSTAT_C5EVT_POSITION                   0x0000000C
#define _CMSTAT_C5EVT_MASK                       0x00001000
#define _CMSTAT_C5EVT_LENGTH                     0x00000001

#define _CMSTAT_PSIDL_POSITION                   0x0000000F
#define _CMSTAT_PSIDL_MASK                       0x00008000
#define _CMSTAT_PSIDL_LENGTH                     0x00000001

#define _CVR1CON_CVR_POSITION                    0x00000000
#define _CVR1CON_CVR_MASK                        0x0000000F
#define _CVR1CON_CVR_LENGTH                      0x00000004

#define _CVR1CON_CVRSS_POSITION                  0x00000004
#define _CVR1CON_CVRSS_MASK                      0x00000010
#define _CVR1CON_CVRSS_LENGTH                    0x00000001

#define _CVR1CON_CVRR_POSITION                   0x00000005
#define _CVR1CON_CVRR_MASK                       0x00000020
#define _CVR1CON_CVRR_LENGTH                     0x00000001

#define _CVR1CON_CVROE_POSITION                  0x00000006
#define _CVR1CON_CVROE_MASK                      0x00000040
#define _CVR1CON_CVROE_LENGTH                    0x00000001

#define _CVR1CON_CVREN_POSITION                  0x00000007
#define _CVR1CON_CVREN_MASK                      0x00000080
#define _CVR1CON_CVREN_LENGTH                    0x00000001

#define _CVR1CON_VREFSEL_POSITION                0x0000000A
#define _CVR1CON_VREFSEL_MASK                    0x00000400
#define _CVR1CON_VREFSEL_LENGTH                  0x00000001

#define _CVR1CON_CVRR1_POSITION                  0x0000000B
#define _CVR1CON_CVRR1_MASK                      0x00000800
#define _CVR1CON_CVRR1_LENGTH                    0x00000001

#define _CVR1CON_CVR0_POSITION                   0x00000000
#define _CVR1CON_CVR0_MASK                       0x00000001
#define _CVR1CON_CVR0_LENGTH                     0x00000001

#define _CVR1CON_CVR1_POSITION                   0x00000001
#define _CVR1CON_CVR1_MASK                       0x00000002
#define _CVR1CON_CVR1_LENGTH                     0x00000001

#define _CVR1CON_CVR2_POSITION                   0x00000002
#define _CVR1CON_CVR2_MASK                       0x00000004
#define _CVR1CON_CVR2_LENGTH                     0x00000001

